-- 5.1 Для однієї з таблиць, що містить обмеження цілісності зовнішнього ключа, виконати
-- команду зміни значення колонки зовнішнього ключа на значення, яке відсутнє в колонці
-- первинного ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.

UPDATE furniture SET type_code = 5 WHERE id = 1;

-- Result : помилка
-- [23000][2291] ORA-02291: integrity constraint (POSHTARENKO.FURNITURE_TYPE_CODE_FK) violated - parent key not found

-- 5.2 Повторити рішення завдання 5.1, але таке, що не призводить до порушення цілісності
-- зовнішнього ключа.

UPDATE furniture SET price = price + 3000 WHERE id = 2;

-- Result : OK

-- 5.3 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, пов'язане з
-- колонкою зовнішнього ключа іншої таблиці, виконати одну команду видалення рядка зі значенням
-- колонки первинного ключа, що є в колонці зовнішнього ключа іншої таблиці. Перевірити реакцію
-- СКБД видалення.

DELETE FROM type WHERE code = 1;

-- Result : помилка
-- [23000][2292] ORA-02292: integrity constraint (POSHTARENKO.FURNITURE_TYPE_CODE_FK) violated - child record found

-- 5.4 Повторити рішення завдання 5.3, але таке, що не призводить до порушення цілісності
-- зовнішнього ключа.
-- Для цього мені спочатку треба буде додати рядки у таблиці Type, на які не буде посилатися таблиця
-- Furniture, бо наразі таких немає

INSERT INTO type (code, name) VALUES (3, 'Sofa');
DELETE FROM type WHERE code = 3;

-- Result : OK

-- 5.5 Для однієї з таблиць, що містить обмеження цілісності первинного ключа, виконати
-- команду зміни значення колонки первинного ключа на значення, яке відсутнє у колонці
-- зовнішнього ключа відповідної таблиці. Перевірити реакцію СКБД на таку зміну.

UPDATE type SET code = 3 WHERE code = 1;
-- -- Result : помилка
-- [23000][2292] ORA-02292: integrity constraint (POSHTARENKO.FURNITURE_TYPE_CODE_FK) violated - child record found

-- 5.6 Повторити рішення завдання 5.5, але таке, що не призводить до порушення цілісності
-- зовнішнього ключа.

INSERT INTO type (code, name) VALUES (3, 'Sofa');
UPDATE type SET code = 4 WHERE code = 3;

-- Result : OK