-- 1. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
-- отримає усереднені (avg) значення другої колонки кожного рядка в кожній підгрупі.

-- Отримаємо всі меблі, додавши нову колонку "середня повна вартість" відносно компанії-виробника (колонка producer)

SELECT name,
       producer,
       price * amount AS                                total_price,
       ROUND(AVG(price * amount) OVER (PARTITION BY producer)) avg_total_price
FROM furniture;

-- +----------+-----------------+-----------+---------------+
-- |NAME      |PRODUCER         |TOTAL_PRICE|AVG_TOTAL_PRICE|
-- +----------+-----------------+-----------+---------------+
-- |Table N2  |Based Corporation|390000     |337500         |
-- |Bed N3    |Based Corporation|285000     |337500         |
-- |Table N33 |Kyiv furniture   |192500     |192500         |
-- |Bed N4    |Lviv factory     |1130000    |406667         |
-- |Shelf N453|Lviv factory     |27000      |406667         |
-- |Bed NNN1  |Lviv factory     |63000      |406667         |
-- +----------+-----------------+-----------+---------------+

-- 2. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення. Створіть запит, який
-- отримає накопичувальні підсумки другої колонки.

-- Отримаємо всі меблі, додавши нову колонку "сумарна повна вартість" з накопичувальною середньою
-- вартістю меблів на момент дати їхньої останньої поставки (колонка last_supply_date)

SELECT name,
       producer,
       last_supply_date,
       price * amount AS                                    total_price,
       SUM(price * amount) OVER (ORDER BY last_supply_date) sum_total_price
FROM furniture;

-- +----------+-----------------+----------------+-----------+---------------+
-- |NAME      |PRODUCER         |LAST_SUPPLY_DATE|TOTAL_PRICE|SUM_TOTAL_PRICE|
-- +----------+-----------------+----------------+-----------+---------------+
-- |Bed N3    |Based Corporation|2022-01-30      |285000     |285000         |
-- |Table N2  |Based Corporation|2022-03-30      |390000     |675000         |
-- |Bed N4    |Lviv factory     |2022-05-30      |1130000    |1805000        |
-- |Bed NNN1  |Lviv factory     |2022-09-30      |63000      |1868000        |
-- |Table N33 |Kyiv furniture   |2022-10-30      |192500     |2060500        |
-- |Shelf N453|Lviv factory     |2022-11-30      |27000      |2087500        |
-- +----------+-----------------+----------------+-----------+---------------+

-- 3. Виконайте попереднє завдання, отримавши накопичувальні підсумки в кожній
-- підгрупі окремо.

-- Отримаємо всі меблі, додавши нову колонку "сумарна повна вартість" відносно компанії-виробника (колонка producer)
-- з накопичувальною середньою вартістю меблів на момент дати їхньої останньої поставки (колонка last_supply_date)

SELECT name,
       producer,
       last_supply_date,
       price * amount AS                                                          total_price,
       SUM(price * amount) OVER (PARTITION BY producer ORDER BY last_supply_date) sum_total_price
FROM furniture;

-- +----------+-----------------+----------------+-----------+---------------+
-- |NAME      |PRODUCER         |LAST_SUPPLY_DATE|TOTAL_PRICE|SUM_TOTAL_PRICE|
-- +----------+-----------------+----------------+-----------+---------------+
-- |Bed N3    |Based Corporation|2022-01-30      |285000     |285000         |
-- |Table N2  |Based Corporation|2022-03-30      |390000     |675000         |
-- |Table N33 |Kyiv furniture   |2022-10-30      |192500     |192500         |
-- |Bed N4    |Lviv factory     |2022-05-30      |1130000    |1130000        |
-- |Bed NNN1  |Lviv factory     |2022-09-30      |63000      |1193000        |
-- |Shelf N453|Lviv factory     |2022-11-30      |27000      |1220000        |
-- +----------+-----------------+----------------+-----------+---------------+