-- 1. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення.
-- Створіть запит, який отримає накопичувальні підсумки другої колонки від початку
-- вікна до поточного рядка.

-- Отримаємо всі меблі, додавши нову колонку "сумарна повна вартість" з накопичувальною середньою
-- вартістю меблів на момент дати їхньої останньої поставки (колонка last_supply_date)

SELECT name,
       producer,
       last_supply_date,
       price * amount AS                                         total_price,
       SUM(price * amount)
           OVER (ORDER BY last_supply_date
               ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) sum_total_price
FROM furniture;

-- +----------+-----------------+----------------+-----------+---------------+
-- |NAME      |PRODUCER         |LAST_SUPPLY_DATE|TOTAL_PRICE|SUM_TOTAL_PRICE|
-- +----------+-----------------+----------------+-----------+---------------+
-- |Bed N3    |Based Corporation|2022-01-30      |285000     |285000         |
-- |Table N2  |Based Corporation|2022-03-30      |390000     |675000         |
-- |Bed N4    |Lviv factory     |2022-05-30      |1130000    |1805000        |
-- |Bed NNN1  |Lviv factory     |2022-09-30      |63000      |1868000        |
-- |Table N33 |Kyiv furniture   |2022-10-30      |192500     |2060500        |
-- |Shelf N453|Lviv factory     |2022-11-30      |27000      |2087500        |
-- +----------+-----------------+----------------+-----------+---------------+


-- 2. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення.
-- Створіть запит, який отримає накопичувальні підсумки другої колонки
-- попереднього та поточного рядка (ковзаюче вікно розміром 2 рядки).

SELECT name,
       producer,
       last_supply_date,
       price * amount AS                                  total_price,
       SUM(price * amount)
           OVER (ORDER BY last_supply_date
               ROWS BETWEEN 1 PRECEDING AND CURRENT ROW ) sum_total_price
FROM furniture;

-- +----------+-----------------+----------------+-----------+---------------+
-- |NAME      |PRODUCER         |LAST_SUPPLY_DATE|TOTAL_PRICE|SUM_TOTAL_PRICE|
-- +----------+-----------------+----------------+-----------+---------------+
-- |Bed N3    |Based Corporation|2022-01-30      |285000     |285000         |
-- |Table N2  |Based Corporation|2022-03-30      |390000     |675000         |
-- |Bed N4    |Lviv factory     |2022-05-30      |1130000    |1520000        |
-- |Bed NNN1  |Lviv factory     |2022-09-30      |63000      |1193000        |
-- |Table N33 |Kyiv furniture   |2022-10-30      |192500     |255500         |
-- |Shelf N453|Lviv factory     |2022-11-30      |27000      |219500         |
-- +----------+-----------------+----------------+-----------+---------------+

-- 3. Одна з колонок таблиці повинна містити значення, що повторюються, для
-- виділення підгруп, інша колонка повинна мати числові значення.
-- Створіть запит, який отримає:
--  накопичувальні підсумки другої колонки від початку вікна до поточного
-- рядка для кожного вікна цілком
--  накопичувальний результат порядково (для демонстрації відмінностей
-- роботи типу RANG від ROWS).

SELECT name,
       last_supply_date,
       price * amount AS                                          total_price,
       SUM(price * amount)
           OVER (ORDER BY last_supply_date
               ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW)  sum_total_price,
       SUM(price * amount)
           OVER (ORDER BY last_supply_date
               RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) sum_total_price2
FROM furniture;

-- +----------+----------------+-----------+---------------+----------------+
-- |NAME      |LAST_SUPPLY_DATE|TOTAL_PRICE|SUM_TOTAL_PRICE|SUM_TOTAL_PRICE2|
-- +----------+----------------+-----------+---------------+----------------+
-- |Bed N3    |2022-01-30      |285000     |285000         |285000          |
-- |Table N2  |2022-03-30      |390000     |675000         |675000          |
-- |Bed N4    |2022-05-30      |1130000    |1805000        |1805000         |
-- |Bed NNN1  |2022-09-30      |63000      |1868000        |1868000         |
-- |Table N33 |2022-10-30      |192500     |2060500        |2060500         |
-- |Shelf N453|2022-11-30      |27000      |2087500        |2087500         |
-- +----------+----------------+-----------+---------------+----------------+
